Autodesk.Revit.DB.BoundingBoxXYZ
A three-dimensional rectangular box at an arbitrary location and orientation within the Revit model.
Remarks:
BoundingBoxXYZ objects are used in Revit in several places related to views (for example, the section box of a
3D view or the definition of a section or detail view).  BoundingBoxXYZ objects can also be obtained from elements representing the
boundary of the element in a given view.
The extents of the box are determined by three orthogonal planes extended through the minimum (Autodesk.Revit.DB.BoundingBoxXYZ.Min)
and maximum (Autodesk.Revit.DB.BoundingBoxXYZ.Max) points, but the coordinates of these points and the orientation of the planes
in relation to the coordinates of the source model is determined by the box Transform (Autodesk.Revit.DB.BoundingBoxXYZ.Transform).
This class also has the ability to detect and mark certain extents as disabled.  Note that in the current Revit API uses
of this class it is not expected that Revit will give objects with disabled extents, and disabled extents in objects
sent to Revit will likely be ignored.
Note: the bounding box may not be empty even if Element::Geometry::get returns nothing. This can happen if the
element contains no 3D model geometry since by default, Element::Geometry::get only returns 3D model geometry while
GeometryElement::GetBoundingBox also takes 2D plan-view geometry and elevation-view geometry into account.